{
  "name": "WS 19/20 ODS Einführung in die Programmierung",
  "link": "https://isis.tu-berlin.de/course/view.php?id=17093",
  "messages": [
    {
      "text": "Liebe Studierende,  folgender Bewertungsschlüssel gilt für die Klausur vom 1.07.2020:         Bereich Note     0 <= x < 29,5    5 29,5 <= x < 32,45      4 32,45 <= x < 35,4    3,7 35,4 <= x < 38,35    3,3 38,35 <= x < 41,3    3 41,3 <= x < 44,25    2,7 44,25 <= x < 47,2    2,3 47,2 <= x < 50,15    2 50,15 <= x < 53,1    1,7 53,1 <= x < 56,05    1,3 56,05 <= x <= 59    1   Maximal konnten 59 Punkte erreicht werden. Wie viel Punkte Sie erreicht haben, sehen Sie in Osiris.  Die Klausureinsicht von der Klausur am 1.7. wird am 21. Juli von 13-15 Uhr Uhr stattfinden.   Aus gegebenem Anlass (Corona-Lage) bieten wir Sie, die Einsicht nur im Falle dringlicher Gründe oder wenn Sie nicht bestanden haben in Anspruch zu nehmen (siehe Info-Brief an alle Studierende zu Klausuren im Sommersemester 2020 vom 29. Mai 2020).  Um an der Einsicht teilzunehmen, melden sie sich bitte bei uns (IP ODS <introprog@ods.tu-berlin.de>) unter Angabe ihrer Gründe an. Sie bekommen dann einen Zeitslot zugewiesen, zu dem sie dann erscheinen dürfen. Sie dürfen sich bis Mo, 20. Juli, 23:59 Uhr, für die Einsicht anmelden.  — IntroProg-Team",
      "answers_in_thread": 1,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=307564#p568142"
    },
    {
      "text": "Liebe Studierende,   *Achtung:* Wie bereits angekündigt sind alle QISPOS Anmeldungen vom 03.04. (vormaliger Prüfungstermin) automatisch auf den 01.07. verschoben wurden. Wenn Sie nicht an der Prüfung am 01.07. teilnehmen wollen, müssen Sie aktiv werden und sich in QISPOS vom Termin abmelden.   am Mittwoch, dem 1. Juli 2020 findet die zweite Klausur für “Einführung in die Programmierung” von 9:00 Uhr bis 11:00 Uhr im Raum H0105 (Auditorium) statt.  Der Einlass in den Raum erfolgt ab 9:00 Uhr. Bitte seien sie ein paar Minuten früher vor dem Raum und halten Sie dabei unbedingt die 2 m empfohlenen Sicherheitsabstand ein. Die Mund- und Nasenschütze müssen während Ihres gesamten Aufenthaltes im Gebäude - also auch während der Klausur - getragen werden. Im Audimax sind die Sitzplätze numeriert. Bitte nehmen Sie zügig die Ihnen zugewiesenen Sitzplätze ein und halten Sie sich während der gesamten Klausurzeit an die Sitzordnung. Bitte betreten und verlassen Sie die Reihen geordnet.  Bitte halten Sie stets die vorgegebenen Abstandsregeln ein. Siehe Info-Brief an alle Studierende zu Klausuren im Sommersemester 2020 vom 29. Mai 2020 für Details.   Für das Betreten des Hauptgebäudes benötigen Sie Ihre Studierendenausweise, Qispos-Auszüge oder Bestätigungs-Mails; diese werden an der Pforte kontrolliert. Ohne Belege für die Anmeldung zur Klausur können Sie leider nicht daran teilnehmen. Bitte geben Sie uns unbedingt Bescheid, wenn Ihnen die Bestätigungs-Mail noch fehlt, bzw. Ihre Prüfung in Qispos noch nicht eingetragen wurde. Nachmeldungen werden nicht mehr akzeptiert. Bis zum 30.06.2020 können Sie sich noch abmelden, bei Krankheit noch am Tag der Prüfung per E-Mail an introprog@ods.tu-berlin.de.  Die Abmeldung der Prüfung ist bis zum 30.06. über QISPOS und selbst noch am Tag der Prüfung per E-Mail an Ihr Prüfungsteam ohne der Angabe von Gründen möglich. Dies muss allerdings noch vor Prüfungsbeginn (9 Uhr) geschehen.   Während der Klausur werden wir eine Personenkontrolle durchführen. Bitte legen Sie dafür Ihren Studierendenausweis und Personalausweis/Reisepass vor sich auf den Tisch, damit diese Kontrolle reibungslos funktioniert und Sie ungestört Ihre Klausur schreiben können. Bitte versäumen Sie nicht einen dokumentenechten Stift (kein Bleistift), Schreibutensilien, wie Lineal etc, und Verpflegung mitzubringen. Als Hilfsmittel ist nur ein von Hand beidseitig beschriebenes DIN A4 Blatt (Spickzettel) erlaubt.    Es darf ausschließlich das von uns zur Verfügung gestellte Papier genutzt werden. Die Benutzung von Computern, Mobiltelefonen und Smart-Watches ist verboten und wird als Täuschungsversuch gewertet.  Bitte beachten Sie, dass auch die Sicherheitsabstände während der gesamten Zeit im Gebäude eingehalten werden müssen, z. B. beim Verlassen des Saals nach der Klausur.  Wir bedanken uns vorab für Ihre Mitarbeit in dieser sehr besonderen Situation und wünschen    Viel Erfolg!  Ihr Introprog-Team",
      "answers_in_thread": 1,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=299518#p552312"
    },
    {
      "text": "Liebe Studierende,  für die Möglichkeit, eventuelle Fragen vor der IntroProg-Wiederholungsklausur am 01.07.2020 noch zu beantworten, bieten unsere Tutor/innen Online-Sprechstunden an. Bitte wählen Sie sich bei Interesse in Zoom ein, siehe Link: Q&A - 2. Klausur - Fr, 26.06., 12 - 16 Uhr.  Wir freuen uns auf Ihre Teilnahme.  Beste Grüße, IntroProg-Team",
      "answers_in_thread": 1,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=297119#p547620"
    },
    {
      "text": "Hi! wie ist die Prozentuale Aufteilung der Klausur und der Hausaufgaben? Danke",
      "answers_in_thread": 1,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=262932#p478532"
    },
    {
      "text": "Titel",
      "answers_in_thread": 1,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=261250#p476026"
    },
    {
      "text": "Bei meinen Ergebnissen steht \"worksheet not yet graded\"",
      "answers_in_thread": 2,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=249919#p458450"
    },
    {
      "text": "Ist normal, musst einfach warten, die Bewertung kommt noch.",
      "answers_in_thread": 2,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=249919#p476024"
    },
    {
      "text": "Weiß jamand wo man morgen zur zweiten Einsicht gehen soll? Danke für die Hilfe!",
      "answers_in_thread": 1,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=308237#p569503"
    },
    {
      "text": "Wann werden die Ergebnisse der zweiten Klausur bekannt gegeben ?",
      "answers_in_thread": 2,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=306339#p565728"
    },
    {
      "text": "Schau mal in deine Ergebnisse bei Osiris, heute war meins da eingetragen.",
      "answers_in_thread": 2,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=306339#p568058"
    },
    {
      "text": "Wie wahrscheinlich ist es das die 2. KLAUSUR stattfindet? Es wurde ja gesagt das die Klausuren nach dem 23.03 nicht mehr stattfinden. Ist schon klar das die Klausur ausfällt?",
      "answers_in_thread": 1,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=266624#p484293"
    },
    {
      "text": "Liebe Studierende,  am 14.02. wird zur regulären Zeit eine offene Vorlesung stattfinden. D.h. Sie können die Inhalte bestimmen.  Nennen Sie in diesem Thread Themen aus der Vorlesung, zu denen Sie eine Wiederholung wünschen. Seien Sie dabei möglichst präzise. Themen können auch mehrfach genannt werden. Das hilft uns dabei eine Auswahl zu treffen, von der möglichst viele Studierende profitieren. Bitte beachten Sie trotzdem, dass wir aus Zeitgründen wahrscheinlich nicht auf alle Themenwünsche eingehen können. Die zweite Hälfte der Vorlesung wird eine offene Q&A Runde sein.  -- Christoph Seifert",
      "answers_in_thread": 6,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=261125#p475798"
    },
    {
      "text": "Ich würde sehr gerne nochmal alles zum Thema Pointer durchnehmen - Wann werden sie verwendet? Und vor allem aber: wann muss das Sternchen dran und wann nicht? bzw. Was bedeutet es, wenn das Sternchen dran ist oder eben nicht?",
      "answers_in_thread": 6,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=261125#p475906"
    },
    {
      "text": "ja pointer währen ein ser gutes Thema vlt in Verbindung mit typichen alloc und free fehlern(pointerarithmetik)",
      "answers_in_thread": 6,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=261125#p475921"
    },
    {
      "text": "Eine Gegenüberstellung von allen behandelten Sortieralgorithmen bezüglich ihrer Laufzeit im best, worst und average case in Abhängigkeit von der Anzahl der zu sortierenden Daten wäre sehr hilfreich!",
      "answers_in_thread": 6,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=261125#p476275"
    },
    {
      "text": "Ja, die Sortieralgorithmen im Vergleich hätte ich auch gerne. Wann ist welcher am besten/schlechtesten?  Und die Vorgehensweise bei Korrektheitsbeweisen mit Doppelschleifen. Dazu vielleicht auch einige Beispiele für den Induktionsschritt",
      "answers_in_thread": 6,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=261125#p478324"
    },
    {
      "text": "Ich würde gerne nochmal mehr über Laufzeit im allgemeinen erfahren, vor allem die verschiedenen Landau-Symbole, wie diese Zusammenhängen und wann man welches verwendet.",
      "answers_in_thread": 6,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=261125#p478418"
    },
    {
      "text": "Moin, die allgemeine Einsicht für alle zur Klausur wurde ja glaube ich verschoben(aus verständlichen Gründen). Da hier aber seit dem keine weitere Ankündigung kam mal die Frage: kommt da noch was? Soll es nochmal eine Einsicht für alle geben?",
      "answers_in_thread": 1,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=365726#p681238"
    },
    {
      "text": "Hallo, gibt es bereits neue Informationen wann die Nachschreibeklausur stattfinden wird und in welcher Form? Vielen Dank im Voraus.",
      "answers_in_thread": 1,
      "tutor_answer_in_thread": "",
      "link": "https://isis.tu-berlin.de/mod/forum/discuss.php?d=282073#p516675"
    }
  ]
}